SOAP/ICS_order.xml


<soapenv:Envelope xmlns:orac="http://xmlns.oracle.com/cpqcloud/commerce/oraclecpqo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/pcbpel/cloud/connector/cpq/types">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-2">
            <wsse:Username>venkatapraveen.challa@oracle.com</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Padmaja@1971</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">WhP6ankI2Zj/WtY8EfuVrw==</wsse:Nonce>
            <wsu:Created>{{Date_Time}}</wsu:Created>
         </wsse:UsernameToken>
         <wsu:Timestamp wsu:Id="TS-1">
            <wsu:Created>{{Date_Time}}</wsu:Created>
            <wsu:Expires>{{Date_Time}}</wsu:Expires>
         </wsu:Timestamp>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <typ:process>
         <typ:TransactionType>
            <orac:id>{{bs_id}}</orac:id>
         </typ:TransactionType>
      </typ:process>
   </soapenv:Body>
</soapenv:Envelope>